ConfigFiles/Catalogs/ОбъектыМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОбъектыМетаданных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>uuid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИерархии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИерархии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаМетаданныхВЕдЧисле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРегистраНакопления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРегистровНакопления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСправкуВСодержание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеОписаниеОграниченийДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеПраво</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВводНаОсновании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьДвиженияДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьДвиженияПоРегистру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьКоманды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьМакеты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОграниченияДоступа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПрава</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПредопределенныеДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьРеквизиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьСправочнаяИнформация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьСсылкиИзОбъектовМетаданных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьФормы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСтандартныеКоманды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеразделенныеДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаТестирование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пояснение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоПоддержки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПравилаПоддержки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВидаОбъектаМетаданныхВЕдЧисле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСписка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПривилегированныйРежимПриОтменеПроведения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПривилегированныйРежимПриПроведении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрисутствуетВОсновномХранилище</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыПроекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширенноеПредставлениеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширенноеПредставлениеСписка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрПодчиненРегистратору</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольДляВсехПрофилейПользователей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольСоздаетсяВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинонимДополнительный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереводПроверен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованиеИзменений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСогласованияИзмененияВВетках</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВеткаИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ветки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласующийИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВводитсяНаОсновании</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОписаниеДвиженийПоРегистру</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДвижения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидДвиженияРегистра</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеДвижения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазделыПроекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыПроекта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/InformationRegisters/ПраваДоступаКОбъектамМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПраваДоступаКОбъектамМетаданных</Name>
			<Comment>Загружаемые права.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоляБезОграниченияДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоляСОграничениемДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПолейБезОграниченияДоступа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПолейСОграничениемДоступа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Требуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяНеРавноИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравоДоступа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПраваДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/Catalogs/ОбъектыМетаданных/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем СоздатьГруппыРеквизитов;
Перем СоздаватьОбъектРасширенногоХранения;

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЭтоГруппа Тогда
		Если ЭтоНовый() Тогда
			
			Если НЕ ЗначениеЗаполнено(Владелец) Тогда
				Владелец = Проекты.ПроектПоУмолчанию();
			КонецЕсли;
			
			СогласованиеИзменений = Справочники.Проекты.ВариантСогласованиеИзмененийМетаданныхПоУмолчанию(Владелец);
			ПрисутствуетВОсновномХранилище = Ложь;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ПрисутствуетВОсновномХранилище = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	Если ЭтоГруппа Тогда
		НепроверяемыеРеквизиты.Добавить("Родитель");
	КонецЕсли;
	
	Если Не ЭтоГруппа И Не ЗначениеЗаполнено(Поставщик) Тогда
		НепроверяемыеРеквизиты.Добавить("ПравилоПоддержки");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	Если Не ЭтоГруппа И НЕ ПометкаУдаления Тогда
		ПроверитьНаличиеДублей(Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Заголовок = "Справочник ""Объекты метаданных"":";

	Если Не ЭтоГруппа Тогда
		Наименование = Родитель.ВидОбъектаМетаданныхВЕдЧисле + "." + Имя;
		
		СтруктураОбязательныхПолей = Новый Структура;
		СтруктураОбязательныхПолей.Вставить("Имя");
		
		Универсальные.ПроверитьЗаполнениеРеквизитов(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
		
		Если Отказ Тогда
			ТекстСообщения = НСтр("ru='Объект метаданных '") + СтрЗаменить(ПолныйКод(), "/", ".") + " <" + Наименование + "> " + НСтр("ru='Не записан.'") + Символы.ПС;
			Сообщить(ТекстСообщения, СтатусСообщения.Важное);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СоздаватьОбъектРасширенногоХранения = Ложь;
	Если ДополнительныеСвойства.Свойство("СоздаватьОбъектРасширенногоХранения") Тогда
		СоздаватьОбъектРасширенногоХранения = ДополнительныеСвойства.СоздаватьОбъектРасширенногоХранения;	
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		
		Если НЕ РегистрПодчиненРегистратору Тогда
			ОписаниеДвиженийПоРегистру.Очистить();
		КонецЕсли;
			
	КонецЕсли;
	
	СоздатьГруппыРеквизитов = НЕ ЭтоГруппа И ЭтоНовый();
	
	Если НЕ ЭтоГруппа Тогда
		СкорректироватьДанныеНеСоответствующиеПроекту();
	КонецЕсли;
		
	// Для роли очистим использование прав доступа к объектам метаданных, при установке пометки удаления.
	Если НЕ ЭтоНовый() Тогда
		
		ПометкаУдаленияСсылки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления");
		ИмяКласса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родитель, "Наименование");
		
		Если ПометкаУдаления И НЕ ПометкаУдаленияСсылки И ИмяКласса = "Роли" Тогда
			НаборЗаписей = РегистрыСведений.ПраваДоступаКОбъектамМетаданных.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Роль.Установить(Ссылка);
			НаборЗаписей.Прочитать();
			Для Каждого Запись Из НаборЗаписей Цикл
				Запись.Используется = Ложь;
			КонецЦикла;
			НаборЗаписей.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
	ИзмененоИмяОбъекта = Ложь;

	Если НЕ ЭтоНовый() И НЕ ЭтоГруппа И ДополнительныеСвойства.Свойство("ЗаписьВФорме") Тогда
		
		СтароеИмя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Имя");
		
		Если СтароеИмя <> Имя Тогда
			ИзмененоИмяОбъекта = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ИзмененоИмяОбъекта", ИзмененоИмяОбъекта);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);

	ИмяКласса = РаботаСОбъектамиМетаданных.ИмяКлассаОбъектаМетаданных(Ссылка);
	
	Если СоздатьГруппыРеквизитов Тогда
		
		Если ИмяКласса = "Константы" Тогда
			
		ИначеЕсли ИмяКласса = "Справочники" Тогда
			СоздатьГруппуРеквизитов("СтандартныеРеквизиты", "Стандартные реквизиты", Перечисления.ВидыРеквизитов.СтандартныеРеквизиты);
			СоздатьГруппуРеквизитов("Реквизиты", "Реквизиты", Перечисления.ВидыРеквизитов.Реквизиты);
			
		ИначеЕсли ИмяКласса = "Документы" Тогда
			СоздатьГруппуРеквизитов("СтандартныеРеквизиты", "Стандартные реквизиты", Перечисления.ВидыРеквизитов.СтандартныеРеквизиты);
			СоздатьГруппуРеквизитов("Реквизиты", "Реквизиты", Перечисления.ВидыРеквизитов.Реквизиты);
			
		ИначеЕсли ИмяКласса = "ЖурналыДокументов" Тогда
			СоздатьГруппуРеквизитов("СтандартныеРеквизиты", "Стандартные реквизиты", Перечисления.ВидыРеквизитов.СтандартныеРеквизиты);
			СоздатьГруппуРеквизитов("Графы", "Графы", Перечисления.ВидыРеквизитов.Графы);
			
		ИначеЕсли ИмяКласса = "Перечисления" Тогда
			
		ИначеЕсли ИмяКласса = "Отчеты" Тогда
			СоздатьГруппуРеквизитов("Реквизиты", "Реквизиты", Перечисления.ВидыРеквизитов.Реквизиты);
			
		ИначеЕсли ИмяКласса = "Обработки" Тогда
			СоздатьГруппуРеквизитов("Реквизиты", "Реквизиты", Перечисления.ВидыРеквизитов.Реквизиты);
			
		ИначеЕсли  ИмяКласса = "ПланыВидовХарактеристик" Тогда
			СоздатьГруппуРеквизитов("СтандартныеРеквизиты", "Стандартные реквизиты", Перечисления.ВидыРеквизитов.СтандартныеРеквизиты);
			СоздатьГруппуРеквизитов("Реквизиты", "Реквизиты", Перечисления.ВидыРеквизитов.Реквизиты);
			
		ИначеЕсли  ИмяКласса = "ПланыСчетов" Тогда
			СоздатьГруппуРеквизитов("СтандартныеРеквизиты", "Стандартные реквизиты", Перечисления.ВидыРеквизитов.СтандартныеРеквизиты);
			СоздатьГруппуРеквизитов("ПризнакиУчета", "Признаки учета", Перечисления.ВидыРеквизитов.ПризнакиУчета);
			СоздатьГруппуРеквизитов("Реквизиты", "Реквизиты", Перечисления.ВидыРеквизитов.Реквизиты);
			
		ИначеЕсли  ИмяКласса = "ПланыВидовРасчета" Тогда
			СоздатьГруппуРеквизитов("СтандартныеРеквизиты", "Стандартные реквизиты", Перечисления.ВидыРеквизитов.СтандартныеРеквизиты);
			СоздатьГруппуРеквизитов("Реквизиты", "Реквизиты", Перечисления.ВидыРеквизитов.Реквизиты);
			
		ИначеЕсли  ИмяКласса = "РегистрыСведений" Тогда
			СоздатьГруппуРеквизитов("СтандартныеРеквизиты", "Стандартные реквизиты", Перечисления.ВидыРеквизитов.СтандартныеРеквизиты);
			СоздатьГруппуРеквизитов("Измерения", "Измерения", Перечисления.ВидыРеквизитов.Измерения);
			СоздатьГруппуРеквизитов("Ресурсы", "Ресурсы", Перечисления.ВидыРеквизитов.Ресурсы);
			СоздатьГруппуРеквизитов("Реквизиты", "Реквизиты", Перечисления.ВидыРеквизитов.Реквизиты);
			
		ИначеЕсли  ИмяКласса = "РегистрыНакопления" Тогда
			СоздатьГруппуРеквизитов("СтандартныеРеквизиты", "Стандартные реквизиты", Перечисления.ВидыРеквизитов.СтандартныеРеквизиты);
			СоздатьГруппуРеквизитов("Измерения", "Измерения", Перечисления.ВидыРеквизитов.Измерения);
			СоздатьГруппуРеквизитов("Ресурсы", "Ресурсы", Перечисления.ВидыРеквизитов.Ресурсы);
			СоздатьГруппуРеквизитов("Реквизиты", "Реквизиты", Перечисления.ВидыРеквизитов.Реквизиты);
			
		ИначеЕсли  ИмяКласса = "РегистрыБухгалтерии" Тогда
			СоздатьГруппуРеквизитов("СтандартныеРеквизиты", "Стандартные реквизиты", Перечисления.ВидыРеквизитов.СтандартныеРеквизиты);
			СоздатьГруппуРеквизитов("Измерения", "Измерения", Перечисления.ВидыРеквизитов.Измерения);
			СоздатьГруппуРеквизитов("Ресурсы", "Ресурсы", Перечисления.ВидыРеквизитов.Ресурсы);
			СоздатьГруппуРеквизитов("Реквизиты", "Реквизиты", Перечисления.ВидыРеквизитов.Реквизиты);
			
		ИначеЕсли  ИмяКласса = "РегистрыРасчета" Тогда
			СоздатьГруппуРеквизитов("СтандартныеРеквизиты", "Стандартные реквизиты", Перечисления.ВидыРеквизитов.СтандартныеРеквизиты);
			СоздатьГруппуРеквизитов("Измерения", "Измерения", Перечисления.ВидыРеквизитов.Измерения);
			СоздатьГруппуРеквизитов("Ресурсы", "Ресурсы", Перечисления.ВидыРеквизитов.Ресурсы);
			СоздатьГруппуРеквизитов("Реквизиты", "Реквизиты", Перечисления.ВидыРеквизитов.Реквизиты);
			
		ИначеЕсли  ИмяКласса = "БизнесПроцессы" Тогда
			СоздатьГруппуРеквизитов("СтандартныеРеквизиты", "Стандартные реквизиты", Перечисления.ВидыРеквизитов.СтандартныеРеквизиты);
			СоздатьГруппуРеквизитов("Реквизиты", "Реквизиты", Перечисления.ВидыРеквизитов.Реквизиты);
			
		ИначеЕсли  ИмяКласса = "Задачи" Тогда
			СоздатьГруппуРеквизитов("СтандартныеРеквизиты", "Стандартные реквизиты", Перечисления.ВидыРеквизитов.СтандартныеРеквизиты);
			СоздатьГруппуРеквизитов("РеквизитыАдресации", "Реквизиты адресации", Перечисления.ВидыРеквизитов.РеквизитыАдресации);
			СоздатьГруппуРеквизитов("Реквизиты", "Реквизиты", Перечисления.ВидыРеквизитов.Реквизиты);
			
		ИначеЕсли  ИмяКласса = "Последовательности" Тогда
			СоздатьГруппуРеквизитов("Измерения", "Измерения", Перечисления.ВидыРеквизитов.Измерения);
			
		КонецЕсли;
	КонецЕсли;
	
	// Создание объекта расширенного хранения
	Если РаботаСОбъектамиМетаданных.ЭтоКлассОбъектаРасширенногоХранения(ИмяКласса)  Тогда
		
		Если СоздаватьОбъектРасширенногоХранения Тогда
			Если ОбщегоНазначенияСППР.СвойстваОбъектаРасширенногоХранения(Ссылка) = Неопределено Тогда
				
				ИмяСправочникаРасширенныхСвойств = ИмяКласса + "Свойства";
				ДопОбъектМетаданных = Справочники[ИмяСправочникаРасширенныхСвойств].СоздатьЭлемент();
				Универсальные.УстановитьНовоеЗначение(ДопОбъектМетаданных.Владелец, Ссылка);
				Универсальные.УстановитьНовоеЗначение(ДопОбъектМетаданных.Наименование, Имя);
				ДопОбъектМетаданных.Записать();
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ИзмененоИмяОбъекта") Тогда
		ИзменитьИмяПодчиненных = ДополнительныеСвойства.ИзмененоИмяОбъекта;
	Иначе
		ИзменитьИмяПодчиненных = Ложь;
	КонецЕсли;
	
	Если ИзменитьИмяПодчиненных Тогда
		
		ПодчиненныеОбъекты = ПодчиненныеОбъекты();
		
		Для Каждого ПодчиненныйОбъектСсылка из ПодчиненныеОбъекты Цикл
			
			Попытка
				ПодчиненныйОбъект = ПодчиненныйОбъектСсылка.ПолучитьОбъект();
				ПодчиненныйОбъект.Заблокировать();
				ПодчиненныйОбъект.Записать();
				ПодчиненныйОбъект.Разблокировать();
			Исключение
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПодчиненныеОбъекты()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КомандыОбъектовМетаданных.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КомандыОбъектовМетаданных КАК КомандыОбъектовМетаданных
	|ГДЕ
	|	КомандыОбъектовМетаданных.Владелец = &Владелец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МакетыОбъектовМетаданных.Ссылка
	|ИЗ
	|	Справочник.МакетыОбъектовМетаданных КАК МакетыОбъектовМетаданных
	|ГДЕ
	|	МакетыОбъектовМетаданных.Владелец = &Владелец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ФормыОбъектовМетаданных.Ссылка
	|ИЗ
	|	Справочник.ФормыОбъектовМетаданных КАК ФормыОбъектовМетаданных
	|ГДЕ
	|	ФормыОбъектовМетаданных.Владелец = &Владелец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредопределенныеДанные.Ссылка
	|ИЗ
	|	Справочник.ПредопределенныеДанные КАК ПредопределенныеДанные
	|ГДЕ
	|	ПредопределенныеДанные.Владелец = &Владелец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеквизитыОбъектовМетаданных.Ссылка
	|ИЗ
	|	Справочник.РеквизитыОбъектовМетаданных КАК РеквизитыОбъектовМетаданных
	|ГДЕ
	|	РеквизитыОбъектовМетаданных.Владелец = &Владелец"
	;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Владелец", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Создание новой группы
Процедура СоздатьГруппуРеквизитов(ТекИмя, ТекСиноним, ВидРеквизита)

	НоваяГруппа = Справочники.РеквизитыОбъектовМетаданных.СоздатьГруппу();

	НоваяГруппа.ВидРеквизита = ВидРеквизита;
	НоваяГруппа.Владелец     = Ссылка;
	НоваяГруппа.Имя          = ТекИмя;
	НоваяГруппа.Синоним      = ТекСиноним;

	НоваяГруппа.Записать();

КонецПроцедуры

Процедура ПроверитьНаличиеДублей(Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстЗапроса=
	"ВЫБРАТЬ
	|	ОбъектыМетаданных.Ссылка КАК ОбъектыМетаданных
	|ИЗ
	|	Справочник.ОбъектыМетаданных КАК ОбъектыМетаданных
	|ГДЕ
	|	(ОбъектыМетаданных.Владелец = &Проект
	|	И ОбъектыМетаданных.Родитель = &Родитель
	|	И ОбъектыМетаданных.Имя = &Имя
	|	И ОбъектыМетаданных.Ссылка <> &Ссылка)
	|   И НЕ ОбъектыМетаданных.ПометкаУдаления"
	;
			
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Родитель", Родитель);
	Запрос.УстановитьПараметр("Проект", Владелец);
	Запрос.УстановитьПараметр("Имя", Имя);
	
	Запрос.Текст = ТекстЗапроса;
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		ТекстСообщения = НСтр("ru='В информационной базе уже существует объект метаданных с именем %Имя%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Имя%", Имя);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект, "Имя");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура СкорректироватьДанныеНеСоответствующиеПроекту()
	
	Если ЗначениеЗаполнено(РазделПроекта) Тогда
		
		ПроектРаздела = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РазделПроекта, "Владелец");
		
		Если ПроектРаздела <> Владелец Тогда
			РазделПроекта = Справочники.РазделыПроекта.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

ДополнительныеСвойства.Вставить("СоздаватьОбъектРасширенногоХранения", Истина);

#КонецОбласти

#КонецЕсли
